<?php
/**
 * 定界符号声明字符串
 * 1.使用三个<<< 小于号
 * 2.在开始的定界符(自定义的字符串中)左边一定要挨着<<<，写完定界符直接回车(禁止空格)
 * 3.在结束的定界符，顶头写。和开头必须一样且分号后直接回车
 * 4.使用''(单引号)在开始定界符中，将支持双引号的 功能改成了单引号。
 */
          $str = <<<hello
"""""""""""""""""""""""""""""""""""""""""""""'''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''"""""""""""\n"""""""""""""""""""""""""""""""""""""""""""""""''''''''''''""""""""""""'''''''""""""""""
hello;
echo $str;
          $str =<<<'hello'
          this is a \n demo;
hello;
echo $str;

 ?>
