<?php
/**
 * 1.只有变量才能有引用（$） $10是错误的
 * 2.一个变量发生变化,另一个的值也会发生变化
 * 3.在使用unset()函数时，如果有引用关系，只解除调用变量！
 * 4.如果两个变量是引用关系，同时变化。如果其中一个引用重新引用新的变量则被替换！
 */
          $a=10;
          $b=&$a;
          unset($a);
          if( isset($a) ){
                    echo "这个变量存在";
          }else{
                    echo "这个变量不存在";
          }
          echo $b;

          echo "<br>";
          echo "-------------------------------分隔符-------------------------------";
          echo "<br>";
          unset($b);

          $a=10;
          $b=&$a;

          $c=100;
          $b=&$c;

          $b=99;
          echo "a=".$a.";b=".$b.";c=".$c;
 ?>


<br>
<a href="http://www.shucunwang.com/RunCode/php/" target="_blank">php在线测试</a>
