<?php
/**
 * PHP的运算符符号
 *
 * 一元运算符  +1 -1 ++  -- ！
 * 二元运算符  + - * / % > < =  ==   ===
 * 三元运算符   1?2:3 (问号表达式)
 *
 *
 * 算数运算符: + - * / % ++ --
 * 赋值运算符: = +=  -=  *=  /=  %=
 * 比较运算符:> < ==  >= <=   ===  !=   !==
 * 逻辑运算符:&&   ||   ！
 * 位运算符号:& |  ^ ~ >>  <<
 *
 * 其他运算符:?:0  => ->
 *
 */




 ?>

 <pre>
           * PHP的运算符符号
           *
           * 一元运算符  +1 -1 ++  -- ！
           * 二元运算符  + - * / % > < =  ==   ===
           * 三元运算符   1?2:3 (问号表达式)
           *
           *
           * 算数运算符: + - * / % ++ --
           * 赋值运算符: = +=  -=  *=  /=  %=
           * 比较运算符:> < ==  >= <=   ===  !=   !==
           * 逻辑运算符:&&   ||   ！
           * 位运算符号:& |  ^ ~ >>  <<
           *
           * 其他运算符:?:0  => ->
 </pre>
